Configurar SSH
Ativação do SSH
O Telnet simplifica o acesso remoto ao dispositivo, mas não é seguro. Os dados contidos em um pacote Telnet são transmitidos sem criptografia. Por esse motivo, é altamente recomendável ativar o Secure Shell (SSH) em dispositivos para acesso remoto seguro.

É possível configurar um dispositivo Cisco para suportar SSH usando as seis etapas a seguir:

Etapa 1. Configure a unique device hostname. Um dispositivo deve ter um nome de host exclusivo diferente do padrão.

Etapa 2. Configure o nome do domínio IP. Configure o nome de domínio IP da rede usando o comando global de configuração do modo ip domain name name. No exemplo, o roteador R1 é configurado no domínio Span.com. Esta informação é usada junto com o valor do bit especificado no comando crypto key generate rsa general-keys modulus para criar uma chave de criptografia

Etapa 3. Gerar uma chave para criptografar o tráfego do SSH. O SSH criptografa o tráfego entre a origem e o destino. No entanto, para fazer isso, uma chave de autenticação exclusiva deve ser gerada usando o comando de configuração global crypto key generate rsa general-keys modulus bits. O módulo bits determina o tamanho da chave e pode ser configurado de 360 bits a 2048 bits. Quanto maior o valor de bit, mais segura a chave. No entanto, valores de bits maiores também levam mais tempo para criptografar e descriptografar informações. O tamanho mínimo recomendado do módulo é 1024 bits.

Etapa 4. Verifique ou crie uma entrada de banco de dados local. Crie uma entrada de nome de usuário do banco de dados local usando o username comando de configuração global. No exemplo, o parâmetro secret é usado para que a senha seja criptografada usando MD5.

Etapa 5. Autenticar contra o banco de dados local. Use o comando de configuração de login local linha para autenticar a linha vty no banco de dados local.

Etapa 6. Habilite a entrada vty nas sessões SSH. Por padrão, nenhuma sessão de entrada é permitida em linhas vty. Você pode especificar vários protocolos de entrada, incluindo Telnet e SSH usando o comando transport input {ssh | telnet}.

Router# configure terminal
Router(config)# hostname R1
R1(config)# ip domain name span.com
R1(config)# crypto key generate rsa general-keys modulus 1024
The name for the keys will be: Rl.span.com % The key modulus size is 1024 bits
% Generating 1024 bit RSA keys, keys will be non-exportable...[OK]
Dec 13 16:19:12.079: %SSH-5-ENABLED: SSH 1.99 has been enabled
R1(config)#
R1(config)# username Bob secret cisco
R1(config)# line vty 0 4
R1(config-line)# login local
R1(config-line)# transport input ssh
R1(config-line)# exit
R1(config)#
Para verificar o SSH e exibir as chaves geradas, use o comando show crypto key mypubkey rsa no modo EXEC privilegiado. Se houver pares de chaves existentes, é recomendável que eles sejam substituídos usando o comando crypto key zeroize rsa. Se houver pares de chaves existentes, é recomendável que eles sejam removidos usando o comando crypto key zeroize rsa. A Figura 2 fornece um exemplo de verificação das chaves criptográficas SSH e da remoção das chaves antigas.

R1# show crypto key mypubkey rsa
% Key pair was generated at: 21:18:41 UTC Feb 16 2015 
Key name: R1.span.com 
Key type: RSA KEYS 
  Storage Device: not specified 
  Usage: General Purpose Key 
  Key is not exportable. 
  Key Data: 
    30819F30 0D06092A 864886F7 0D010101 05000381 8D003081 89028181 00CF35DB  
    A58A1BDB F7C7E600 F189C2F3 2EC6E584 D923EE5B 71841D98 B5472A03 D19CD620  
    ED125825 5A58412B B7F29234 DE2A1809 6C421AC3 07F298E6 80BE149D 2A262E13  
    74888DAF CAC8F187 B11111AF A413E76F 6C157CDF DFEF0D82 2961B58C BE1CAD21  
    176E82B9 6D81F893 06E66C93 94E1C508 887462F6 90AC63CE 5E169845 C1020301 0001 
% Key pair was generated at: 21:18:42 UTC Feb 16 2015 
Key name: R1.span.com.server 
Key type: RSA KEYS 
Temporary key 
  Usage: Encryption Key 
  Key is not exportable. 
  Key Data: 
    307C300D 06092A86 4886F70D 01010105 00036B00 30680261 00AB914D 8172DFBE  
    DE57ACA9 7B844239 1F3B5942 3943AC0D F54E7746 3895CF54 606C3961 8A44FEB3  
    1A019F27 D9E71AAE FC73F423 A59CB8F5 50289272 3392CEBC 4C3CBD6D DB9233DE  
    9DDD9DAD 79D56165 4293AA62 FD1CBAB2 7AB859DC 2890C795 ED020301 0001 
R1# conf t
Enter configuration commands, one per line.  End with CNTL/Z. 
R1(config)# crypto key zeroize rsa
% All keys will be removed. 
% All router certs issued using these keys will also be removed. 
Do you really want to remove these keys? [yes/no]: yes 
R1(config)#


Melhorar a segurança de login SSH
Para verificar os ajustes opcionais do comando SSH, use o comando show ip ssh, segundo as indicações da figura. Você também pode modificar o intervalo de tempo limite SSH padrão e o número de tentativas de autenticação. Use o comando do modo de configuração global ip ssh time-out seconds para modificar o intervalo de tempo limite padrão de 120 segundos. Isso configura o número de segundos que o SSH pode usar para autenticar um usuário. Depois que é autenticado, uma sessão EXEC começa e o exec-timeout padrão configurado para o vty aplica-se.

Por padrão, um usuário que faz login tem três tentativas de inserir a senha correta antes de ser desconectado. Para configurar um número diferente de novas tentativas consecutivas de SSH, use o comando do modo de configuração global ip ssh authentication-retries integer.

R1# show ip ssh 
SSH Enabled - version 2.0 
Authentication methods:publickey,keyboard-interactive,password 
Authentication timeout: 120 secs; Authentication retries: 3 
(output omitted) 
                             
R1# conf t 
Enter configuration commands, one per line.  End with CNTL/Z. 
R1(config)# ip ssh time-out 60 
R1(config)# ip ssh authentication-retries 2 
R1(config)# ^Z 
R1# 
*Feb 16 21:23:51.237: %SYS-5-CONFIG_I: Configured from console by console 
R1# show ip ssh 
SSH Enabled - version 2.0 
Authentication methods:publickey,keyboard-interactive,password 
Authentication timeout: 60 secs; Authentication retries: 2 
(output omitted)


Conecte um roteador a um roteador habilitado para SSH
Para verificar o status das conexões do cliente, use o comando show ssh. Há duas maneiras diferentes de conectar a um roteador habilitado para SSH.

Por padrão, quando o SSH está habilitado, um roteador Cisco pode atuar como um servidor SSH ou cliente SSH. Como um servidor, um roteador pode aceitar conexões de cliente SSH. Como cliente, um roteador pode se conectar via SSH a outro roteador habilitado para SSH mostrado nas três etapas a seguir.

Router-to-Router SSH

Nos exemplos a seguir, o administrador no R1 usa o show ssh para verificar se há conexões SSH atuais. Em seguida, outro administrador faz login no R1 do R2. O administrador no R1 verifica novamente as conexões SSH atuais.

R1# show ssh 
%No SSHv2 server connections running. 
%No SSHv1 server connections running. 
R1#
R2# ssh -l Bob 192.168.2.101 
 
Password:  
 
R1>
R1# show ssh 
Connection Version Mode Encryption  Hmac       State             Username 
0          2.0     IN   aes128-cbc  hmac-sha1  Session started   Bob 
0          2.0     OUT  aes128-cbc  hmac-sha1  Session started   Bob 
%No SSHv1 server connections running. 
R1#

4.4.6
Conecte um host a um roteador habilitado para SSH
Conecte-se usando um cliente SSH em execução em um host, como mostrado nas quatro figuras a seguir. Exemplos desses clientes incluem PuTTY, OpenSSH e TeraTerm.

O procedimento para conectar a um roteador Cisco varia dependendo do aplicativo cliente SSH que está sendo usado. Geralmente, o cliente SSH inicia uma conexão SSH ao roteador. O serviço SSH do roteador solicita a combinação correta de nome de usuário e senha. Depois que o início de uma sessão é verificado, o roteador pode ser controlado como se o administrador estivesse usando uma sessão de Telnet padrão.